; domain
; source => https://github.com/AI-Planning/pddl-generators/blob/main/spanner/domain.pddl
(define (domain spanner)
(:requirements :typing :strips)
(:types
	location locatable - object
	man nut spanner - locatable
)

(:predicates
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(usable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))

(:action walk
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start)
                           (link ?start ?end))
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l)
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l)
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (usable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (usable ?s)) (tightened ?n)))
)

; problem
;; spanners=4, nuts=2, locations=6, out_folder=training/easy, instance_id=41, seed=68

(define (problem spanner-41)
 (:domain spanner)
 (:objects 
    bob - man
    spanner1 spanner2 spanner3 spanner4 - spanner
    nut1 nut2 - nut
    shed location1 location2 location3 location4 location5 location6 gate - location
 )
 (:init 
    (at bob shed)
    (at spanner1 location6)
    (usable spanner1)
    (at spanner2 location4)
    (usable spanner2)
    (at spanner3 location6)
    (usable spanner3)
    (at spanner4 location6)
    (usable spanner4)
    (at nut1 gate)
    (loose nut1)
    (at nut2 gate)
    (loose nut2)
    (link shed location1)
    (link location6 gate)
    (link location1 location2)
     (link location2 location3)
     (link location3 location4)
     (link location4 location5)
     (link location5 location6)
 )
 (:goal  (and (tightened nut1)
   (tightened nut2))))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 2
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 2
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 2
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 2
5. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 2
6. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 2
7. (pickup_spanner location6 spanner1 bob)
   deleted: (at spanner1 location6)
   added: (carrying bob spanner1)
   goals met: 0 of 2
8. (pickup_spanner location6 spanner3 bob)
   deleted: (at spanner3 location6)
   added: (carrying bob spanner3)
   goals met: 0 of 2
9. (walk location6 gate bob)
   deleted: (at bob location6)
   added: (at bob gate)
   goals met: 0 of 2
10. (tighten_nut gate spanner1 bob nut1)
   deleted: (loose nut1) (usable spanner1)
   added: (tightened nut1)
   goals met: 1 of 2
11. (tighten_nut gate spanner3 bob nut2)
   deleted: (loose nut2) (usable spanner3)
   added: (tightened nut2)
   goals met: 2 of 2
